Revit 2024 API
BuiltInFailures.CurveFailures.LineTooShortWarning Property
 Line is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LineTooShortWarning { get; }
Visual Basic
Public Shared ReadOnly Property LineTooShortWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LineTooShortWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace